import Foundation

func print1000() {
    for i in 0...1000 {
        var sum = 0
        var n = i
        while n != 0 {
            sum += n % 10 //при 2 % 10 неполное частное 0 и остаток 2
            //проверка: неполное частное * делитель = 0 * 10 = 0
            //+ остаток = 0 + 2 = 2
            //сравнить результат и делимое 2 = 2
            n /= 10
        }
        if i % 3 == 0 && i % 5 != 0 && sum < 10 {
            print(i)
        }
        
    }
    
}
print1000() /*
 3
 6
 9
 12
 18
 21
 24
 27
 33
 36
 42
 51
 54
 63
 72
 81
 102
 108
 111
 114
 117
 123
 126
 132
 141
 144
 153
 162
 171
 201
 204
 207
 213
 216
 222
 231
 234
 243
 252
 261
 303
 306
 312
 321
 324
 333
 342
 351
 402
 411
 414
 423
 432
 441
 501
 504
 513
 522
 531
 603
 612
 621
 702
 711
 801
 */

